import random
#Приветствие
#Напишите программу, которая спрашивает имя пользователя и выводит "Привет, [имя]!".

name = input("Введите имя")
print("Привет, "+ name + "!")

#Сумма двух чисел
#Запросите у пользователя два числа и выведите их сумму.

number = input("Введите число a")
number1 = input("Введите число b")
a = number
b = number1
c = a + b
print(c)

