import random
#Приветствие
#Напишите программу, которая спрашивает имя пользователя и выводит "Привет, [имя]!".

# name = input("Введите имя")
# print("Привет, "+ name + "!")

#Сумма двух чисел
#Запросите у пользователя два числа и выведите их сумму.

# number = int(input("Введите число a: "))
# number1 = int(input("Введите число b: "))
# a = number
# b = number1
# c = a + b
# print(c)

#Чётное или нечётное
#Пользователь вводит число. Определите, чётное оно или нет, и выведите результат.

# number1 = int(input("Введите число b: "))
# b = number1
#
# if b%2 == 0 :
#     print("чётное")
#
# elif b%2 != 0:
#     print("нечётное")

#Калькулятор
#Спросите у пользователя два числа и операцию (+, -, *, /), затем выполните её и выведите результат.

# number1 = int(input("Введите число a: "))
# number2 = int(input("Введите число b: "))
# oper = input("Введите операцию (+, -, *, /): ")
# if oper == '+':
#     print(number1 + number2)
# elif oper == '-':
#     print(number1 - number2)
# elif oper == '*':
#     print(number1 * number2)
# elif oper == '/':
#     print(number1 / number2)

# Конвертер температуры
# Пользователь вводит температуру в градусах Цельсия, а программа переводит её в Фаренгейты по формуле: F = C * 9/5 + 32.

# C = float(input("Введите температуру в градусах Цельсия: "))
# F = C * 9/5 + 32
# print(F)


# Сумма чисел от 1 до N
# Пользователь вводит число N. Посчитайте и выведите сумму всех чисел от 1 до N.

a = int(input("Введите температуру в градусах Цельсия: "))


